{
    "about":
        {
            "name": "Oseyenbhin Osemeahon",
            "residence": "Canada",
            "province": "Ontario",
            "city": "London, ON",
            "language": ["English", "Turkish"],
            "Hobies": ["Gaming", "Cinematography Enthusiast"],
            "phone": 2263857007,
            "email": "ose.sunday@gmail.com",
            "freelance": "Available",
            "myStory": "I am a passionate programming enthusiast known for my unyielding eagerness and readiness to tackle challenging projects. With a knack for problem-solving and a perpetual curiosity for technological advancements, I thrive in environments that push the boundaries of my programming skills. Beyond my professional pursuits, I have a genuine love for meeting new people and immersing myself in diverse cultures.",
            "frontendSkills": [
                {"name": "REACT", "value": 85}, 
                {"name": "HTML, CSS", "value": 95},  
                { "name": "Javascript", "value" :90}, 
                {"name": "Wordpress", "value": 75},  
                { "name": "Photoshop", "value" :90}],
            "backendSkills": [
                {"name": "Node JS", "value": 50}, 
                {"name": "Django", "value": 75},  
                { "name": "Postgres", "value" :85}, 
                {"name": "Mongo DB", "value": 50}],
            "codingSkills": [ 
                { "name": "Javascript", "value" :85}, 
                {"name": "Python", "value":75},  
                {"name":"PHP", "value": 70}, 
                {"name":"C#", "value": 40}],
            "reactJob": [
                {"name":"Portfolio", "summary": "My official SPA site using React", "git": "https://github.com/osesunday1/React-Portfolio/tree/master/src", "url":"https://www.oseportfolio.com/",
                "description":{"WID": "I developed a dynamic portfolio app featuring three solid components seamlessly integrated on a single page. The first component serves as a navigation menu, guiding users through the app's functionalities. The second component, positioned in the middle, showcases my image with a convenient link to download my resume. The third component, a placeholder on the right, dynamically renders UI content based on user interaction with the navigation menu. Implementing a smooth slide-in animation using CSS transitions, I ensured a visually appealing user experience. All data, including project details, was served via a JSON file I created to mimic an API, enhancing flexibility and scalability", "HID": "Utilizing React.js, I structured the app into modular components, enhancing code organization and maintainability. The dynamic rendering of UI content was achieved through event handling and conditional rendering, triggered by user clicks on the navigation menu. To address the challenge of displaying project descriptions within a reusable modal, I implemented a solution to dynamically populate the modal content based on user interactions. CSS transitions were employed to animate the slide-in effect, enhancing the overall aesthetic appeal of the app. The JSON file served as a centralized data source, facilitating easy updates and modifications to project details.", "IMP": "The portfolio app provides users with a sleek and intuitive interface to explore my projects and credentials. By incorporating dynamic rendering and smooth animations, the app offers an engaging user experience. Users can easily navigate through project descriptions, view project details on hosted platforms, or access project repositories on GitHub. Leveraging a JSON file for data management enhances flexibility and scalability, allowing for seamless updates and additions to project information. Despite challenges in implementing a reusable modal, the solution enhances code efficiency and usability, contributing to the app's overall functionality and appeal."}}, 
                {"name":"Movie Database", "summary":"An app that collects a plethora of imdb movies and displays them with their rating based on user querry", "git":"https://github.com/osesunday1/React-Movie-Database/tree/main/src"}, {"name":"Blog App", "summary":"A dynamic blog website", "git":"https://github.com/osesunday1/React-Blog/tree/main/src"} , 
                {"name":"Travel Planner", "summary":"A react JS App to help travelers efficiently plan to-do list", "git": "https://github.com/osesunday1/React-Travel-Planner/tree/main/src", "url":"https://osesunday1.github.io/React-Travel-Planner/" , "description":{"WID": "In this project, I created a travel planner app using React.js, offering users a platform to input items for their trips. These items are then displayed as a checklist, facilitating easy tracking. Users can mark items as packed with a simple click on checkboxes, visually striking them off. Additionally, I implemented features for deleting individual items and a 'clear list' button for swift list resets.", "HID": "To build the frontend, I leveraged React.js and employed state management to dynamically update the checklist as users interacted with it. Event handling captured user actions such as clicking checkboxes and deleting items. Using React hooks and functional components ensured efficient state management and component reusability. Conditional rendering was utilized to display the struck-off effect when an item is packed.", "IMP": "By streamlining the packing process, the app has significantly reduced stress and confusion for users, leading to smoother travel preparations. Offering an organized checklist and intuitive features for marking items as packed and deleting them has enhanced the overall user experience. Users now have the tools to efficiently manage their packing tasks, resulting in more enjoyable and organized journeys."}} , 
                {"name":"Accordion", "summary":"A display of chained and loose Accordion", "git": "https://github.com/osesunday1/React-Accordion/tree/main/src"}],
            "education": [
                {"degree": "Professional Diploma", "country": "Canada", "date": "2023-2024", "course": "Web Development and Internet Applications"},
                {"degree": "PhD", "country": "Cyprus", "date": "2017-2020", "course": "Management Information Systems"}, {"degree": "MSc", "country": "Cyprus", "date": "2016-2017", "course": "Management Information Systems"}, {"degree": "BTech", "country": "Nigeria", "date": "2009-2015", "course": "Management Technology"}    ]

        }

    

}